app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Primeiro post do blog"], ["body", "<p>Teste da aplicacao</p>\r\n"], ["created_at", 2016-09-22 00:19:46 UTC], ["updated_at", 2016-09-22 00:19:46 UTC]]
---
  def create
    @post = Post.new(post_params)

    if @post.save(post_params)

UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "<p>novo artigo</p>\r\n"], ["updated_at", 2016-09-22 03:37:25 UTC], ["id", 4]]
---
  def update
    if @post.update_attributes(post_params)